nrfconnect/sdk-nrf/applications/nrf5340_audio/src/bluetooth/le_audio_cis_gateway.c
	if ((ret == -EBUSY) && (work_data.retries < CIS_CONN_RETRY_TIMES)) {
		LOG_DBG("Got connect error from stream %d Retrying. code: %d count: %d",
			work_data.channel_index, ret, work_data.retries);
		LOG_DBG("k_msg_put: ch: %d, dir: %d, retries %d", work_data.channel_index,
			work_data.dir, work_data.retries);
		ret = k_msgq_put(&kwork_msgq, &work_data, K_NO_WAIT);
		if (ret) {
			LOG_ERR("No space in the queue for work_data");
			return;
		}
		/* Delay added to prevent controller overloading */
		if (work_data.dir == BT_AUDIO_DIR_SINK) {
			k_work_reschedule(&headsets[work_data.channel_index].stream_start_sink_work,
					  K_MSEC(CIS_CONN_RETRY_DELAY_MS));
		} else if (work_data.dir == BT_AUDIO_DIR_SOURCE) {
			k_work_reschedule(
				&headsets[work_data.channel_index].stream_start_source_work,
				K_MSEC(CIS_CONN_RETRY_DELAY_MS));
		}
	} else if (ret != 0) {
		LOG_ERR("Failed to establish CIS, ret = %d", ret);
		bt_conn_disconnect(headsets[work_data.channel_index].headset_conn,
				   BT_HCI_ERR_REMOTE_USER_TERM_CONN);
	}
}

/**
 * @brief Set the allocation to a preset codec configuration.
 *
 * @param codec The preset codec configuration.
 * @param loc   Location bitmask setting.
 *
 */
static void bt_codec_allocation_set(struct bt_codec *codec, enum bt_audio_location loc)
{
	for (size_t i = 0; i < codec->data_count; i++) {
		if (codec->data[i].data.type == BT_CODEC_CONFIG_LC3_CHAN_ALLOC) {
			codec->data[i].value[0] = loc & 0xff;
			codec->data[i].value[1] = (loc >> 8) & 0xFFU;
			codec->data[i].value[2] = (loc >> 16) & 0xFFU;
			codec->data[i].value[3] = (loc >> 24) & 0xFFU;
			codec->data[i].data.data = codec->data[i].value;
			return;
		}
	}
}

static int temp_cap_index_get(struct bt_conn *conn, uint8_t *index)
{
	if (conn == NULL) {
		LOG_ERR("No conn provided");
		return -EINVAL;
	}

	for (int i = 0; i < ARRAY_SIZE(temp_cap); i++) {
		if (temp_cap[i].conn == conn) {
			*index = i;
			return 0;
		}
	}

	/* Connection not found in temp_cap, searching for empty slot */
	for (int i = 0; i < ARRAY_SIZE(temp_cap); i++) {
		if (temp_cap[i].conn == NULL) {
			temp_cap[i].conn = conn;
			*index = i;
			return 0;
		}
	}

	LOG_WRN("No more space in temp_cap");

	return -ECANCELED;
}

/**
 * @brief  Check if the gateway can support the headset codec capabilities
 *
 * @note   Currently only the sampling frequency is checked
 *
 * @param  cap_array  The array of pointers to codec capabilities
 * @param  size       The size of cap_array
 *
 * @return True if valid codec capability found, false otherwise
 */
static bool valid_codec_cap_check(struct bt_codec cap_array[], size_t size)
{
	const struct bt_codec_data *element;

	/* Only the sampling frequency is checked */
	for (int i = 0; i < size; i++) {
		if (bt_codec_get_val(&cap_array[i], BT_CODEC_LC3_FREQ, &element)) {
			if (element->data.data[0] & BT_AUDIO_CODEC_CAPABILIY_FREQ) {
				return true;
			}
		}
	}

	return false;
}

static void discover_sink_cb(struct bt_conn *conn, struct bt_codec *codec, struct bt_bap_ep *ep,
			     struct bt_bap_unicast_client_discover_params *params)
{
	int ret = 0;
	uint8_t channel_index = 0;
	uint8_t temp_cap_index = 0;

	if (params->err == BT_ATT_ERR_ATTRIBUTE_NOT_FOUND) {
		LOG_INF("No sinks found");
		return;
	} else if (params->err) {
		LOG_ERR("Discovery failed: %d", params->err);
		return;
	}

	ret = temp_cap_index_get(conn, &temp_cap_index);
	if (ret) {
		LOG_ERR("Could not get temporary CAP storage index");
		return;
	}

	if (codec != NULL) {
		if (codec->id != BT_CODEC_LC3_ID) {
			LOG_DBG("Only the LC3 codec is supported");
			return;
		}

		/* params->num_caps is an increasing index that starts at 0 */
		if (params->num_caps <= ARRAY_SIZE(temp_cap[temp_cap_index].codec)) {
			struct bt_codec *store_loc =
				&temp_cap[temp_cap_index].codec[params->num_caps];

			memcpy(store_loc, codec, sizeof(struct bt_codec));

			for (int i = 0; i < codec->data_count; i++) {
				store_loc->data[i].data.data = store_loc->data[i].value;
			}

			for (int i = 0; i < codec->meta_count; i++) {
				store_loc->meta[i].data.data = store_loc->meta[i].value;
			}
		} else {
			LOG_WRN("No more space. Increase CODEC_CAPAB_COUNT_MAX");
		}

		return;
	}

	ret = channel_index_get(conn, &channel_index);
	if (ret) {
		LOG_ERR("Unknown connection, should not reach here");
		return;
	}

	/* At this point the location/channel index of the headset is always known */
	for (int i = 0; i < CONFIG_CODEC_CAP_COUNT_MAX; i++) {
		memcpy(&headsets[channel_index].sink_codec_cap[i], &temp_cap[temp_cap_index].codec,
		       (sizeof(struct bt_codec)));
	}

	if (ep != NULL) {
		/* params->num_eps is an increasing index that starts at 0 */
		if (params->num_eps > 0) {
			LOG_WRN("More than one sink endpoints found, ep idx 0 is used by default");
			return;
		}

		headsets[channel_index].sink_ep = ep;
		return;
	}

	if (headsets[channel_index].sink_ep == NULL) {
		LOG_WRN("No sink endpoints found");
		return;
	}

	LOG_DBG("Sink discover complete: err %d", params->err);

	(void)memset(params, 0, sizeof(*params));

#if (CONFIG_BT_VCP_VOL_CTLR)
	ret = ble_vcs_discover(conn, channel_index);
	if (ret) {
		LOG_ERR("Could not do VCS discover");
	}
#endif /* (CONFIG_BT_VCP_VOL_CTLR ) */

	if (valid_codec_cap_check(headsets[channel_index].sink_codec_cap,
				  ARRAY_SIZE(headsets[channel_index].sink_codec_cap))) {
		if (conn == headsets[AUDIO_CH_L].headset_conn) {
			bt_codec_allocation_set(&lc3_preset_sink.codec,
						BT_AUDIO_LOCATION_FRONT_LEFT);
		} else if (conn == headsets[AUDIO_CH_R].headset_conn) {
			bt_codec_allocation_set(&lc3_preset_sink.codec,
						BT_AUDIO_LOCATION_FRONT_RIGHT);
		} else {
			LOG_ERR("Unknown connection, cannot set allocation");
		}

		ret = bt_bap_stream_config(conn, &headsets[channel_index].sink_stream,
					   headsets[channel_index].sink_ep, &lc3_preset_sink.codec);
		if (ret) {
			LOG_ERR("Could not configure sink stream");
		}
	} else {
		LOG_WRN("No valid codec capability found for %s headset sink",
			headsets[channel_index].ch_name);
	}

	/* Free up the slot in temp_cap */
	memset(temp_cap[temp_cap_index].codec, 0, sizeof(temp_cap[temp_cap_index].codec));
	temp_cap[temp_cap_index].conn = NULL;

